

# Parameters
nc: 4  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  
# DBBG backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f_DSConv, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f_DSConv, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f_DSConv, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f_DSConv, [1024, True]] #8
  - [-1, 1, SPPF, [1024, 5]]  #9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #10
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4 #11
  - [-1, 3, C2f, [512]]  #12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #13
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3 #14
  - [-1, 3, C2f_DSConv, [512]]  # 15 (P3/8-small)#15

#  - [-1, 1, DAttention, []] #16

  - [-1, 1, Conv, [256, 3, 2]] #16
  - [[-1, 12], 1, Concat, [1]]  # cat head P4 #17
  - [-1, 3, C2f_DSConv, [512]]  # 18 (P4/16-medium) #18

  - [-1, 1, Conv, [512, 3, 2]] #19
  - [[-1, 9], 1, Concat, [1]]  # cat head P5 #20
  - [-1, 3, C2f_DSConv, [512]]  # 21 (P5/32-large)#21
  - [-1, 1, DAttention, []] #22

  - [[15, 18, 22], 1, Detect_dyhead, [nc]]  # Detect(P3, P4, P5)
